src/cf/InformationRegisters/РеквизитыУплатыНалоговИПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыУплатыНалоговИПлатежейВБюджет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПеречисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РеквизитыУплатыНалоговИПлатежейВБюджет/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ПоказательТипа.Видимость=ТекущаяДата() < '2015-01-01'; // Приказ Минфина №126н от 30.10.2014.;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиРеквизитовПлатежейВБюджет()
	спБуфер=РегистрыСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.СтатусыПлательщика();
	Для каждого СтрокаКоллекции Из спБуфер Цикл
		Элементы.СтатусСоставителя.СписокВыбора.Добавить(СтрокаКоллекции.Значение, СтрокаКоллекции.Представление);
	КонецЦикла;

	спБуфер=РегистрыСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.ОснованияПлатежа("Налоговый");
	Для каждого СтрокаКоллекции Из спБуфер Цикл
		Элементы.ПоказательОснования.СписокВыбора.Добавить(СтрокаКоллекции.Значение, СтрокаКоллекции.Представление);
	КонецЦикла;

	спБуфер=РегистрыСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.ТипыПлатежа("Налоговый", ТекущаяДата());
	Для каждого СтрокаКоллекции Из спБуфер Цикл
		Элементы.ПоказательТипа.СписокВыбора.Добавить(СтрокаКоллекции.Значение, СтрокаКоллекции.Представление);
	КонецЦикла;

	спБуфер=РегистрыСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.ВидыНалоговыхПериодов();
	Для каждого СтрокаКоллекции Из спБуфер Цикл
		Элементы.ПоказательПериода.СписокВыбора.Добавить(СтрокаКоллекции.Значение, СтрокаКоллекции.Представление);
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов шапки

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="СтатусСоставителя" Тогда
		Если Не ЗначениеЗаполнено(Запись.СтатусСоставителя) И Элемент.СписокВыбора.Количество() > 0 Тогда
			Запись.СтатусСоставителя=Элемент.СписокВыбора[0].Значение;
		КонецЕсли;
		
	ИначеЕсли Элемент.Имя="ПоказательОснования" Тогда
		Если ПустаяСтрока(Запись.ПоказательОснования) Тогда
			Запись.ПоказательОснования="0";
		КонецЕсли;
		УстановитьВидимость();
		
	ИначеЕсли Элемент.Имя="ПоказательТипа" Тогда
		Если ПустаяСтрока(Запись.ПоказательТипа) Тогда
			Запись.ПоказательТипа="0";
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_НачалоВыбора(Элемент, СтандартнаяОбработка)
	Если Элемент.Имя="АдминистраторДохода" ИЛИ Элемент.Имя="ВидДохода" Тогда
		ПараметрыФормы=Новый Структура; СтандартнаяОбработка=Ложь;
		ПараметрыФормы.Вставить("ИмяМакета", ?(Элемент.Имя="АдминистраторДохода", "АдминистраторыДоходовБюджетов", "КлассификацияДоходовБюджетов"));
		ОткрытьФорму("РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.Форма.ФормаВыбораКодаИзКлассификатора", ПараметрыФормы, Элемент, УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Элемент.Имя="ВидДохода" Тогда
		СтатьяДоходаДляПоиска=ВидДохода+"0000"+КОСГУ;
		Если ВыбранноеЗначение=СтатьяДоходаДляПоиска Тогда
			СтандартнаяОбработка=Ложь;
		КонецЕсли;
	    ВидДохода=Лев(ВыбранноеЗначение, 10);		
		ПодвидДохода="1000"; // По умолчанию подставляем подвид "Налог" с кодом 1000
		КОСГУ=Сред(ВыбранноеЗначение, 15);
	КонецЕсли;	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.ВидПеречисления) Тогда //Новая запись
		Запись.ПоказательПериода="МС";
		Запись.ОчередностьПлатежа=5;		
		Запись.ВидПеречисления="НалоговыйПлатеж";
	КонецЕсли;
	ЗаполнитьСпискиРеквизитовПлатежейВБюджет();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АдминистраторДохода=Лев(Запись.КодБК, 3);
	ВидДохода=Сред(Запись.КодБК, 4, 10);
	ПодВидДохода=Сред(Запись.КодБК, 14, 4);
	КОСГУ=Сред(Запись.КодБК, 18);

	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Запись.КодБК=АдминистраторДохода+ВидДохода+ПодвидДохода+КОСГУ;
КонецПроцедуры
